wago-enterprise-education/tesla-cc100-sensorboard/microconnect485USB/src/Microconnect Boarddateien/boards.txt
##Microconnect
Microconnect.name=Microconnect

Microconnect.upload_port.0.board=nano

Microconnect.upload.tool=avrdude
Microconnect.upload.tool.serial=avrdude
Microconnect.upload.protocol=arduino

Microconnect.bootloader.tool=avrdude
Microconnect.bootloader.tool.default=avrdude
Microconnect.bootloader.unlock_bits=0x3F
Microconnect.bootloader.lock_bits=0x0F

Microconnect.build.f_cpu=16000000L
Microconnect.build.core=arduino
Microconnect.build.variant=eightanaloginputs


##Microconnect CPU
Microconnect.menu.cpu.atmega328=ATmega328P

Microconnect.menu.cpu.atmega328.upload.maximum_size=30720
Microconnect.menu.cpu.atmega328.upload.maximum_data_size=2048
Microconnect.menu.cpu.atmega328.upload.speed=19200

Microconnect.menu.cpu.atmega328.bootloader.low_fuses=0xFF
Microconnect.menu.cpu.atmega328.bootloader.high_fuses=0xDA
Microconnect.menu.cpu.atmega328.bootloader.extended_fuses=0xFD
Microconnect.menu.cpu.atmega328.bootloader.file=optiboot/optiboot_Microconnect.hex

Microconnect.menu.cpu.atmega328.build.mcu=atmega328p
